# Задание:
# Напишите программу, которая принимает строку чисел, разделённых запятыми, от пользователя.
# Программа должна выполнить следующие действия:
# 1. Получить строку чисел от пользователя.
# 2. Разделить эту строку по запятым и преобразовать каждое значение в целое число.
# 3. Создать два счетчика для суммы чётных чисел и суммы нечётных чисел.
# 4. Пройтись в цикле по полученному списку чисел:
#    - Для каждого числа определить, является ли оно чётным или нечётным.
#    - Вывести сообщение, например, "Число 4 является чётным" или "Число 5 является нечётным".
#    - Добавить число к соответствующей сумме (чётным или нечётным).
# 5. После цикла вывести итоговые суммы чётных и нечётных чисел.

# Шаг 1: Получите строку чисел от пользователя
input_str = input("Введите числа, разделенные запятыми: ")

# Шаг 2: Разделите строку и преобразуйте каждое число в целое число
# Подсказка: используйте метод split() для разделения строки и функцию int() для преобразования.
# Пример: numbers = [int(x) for x in input_str.split(",")]
numbers = [int(x) for x in input_str.split(",")]  # Напишите свой код здесь для получения списка чисел

# Шаг 3: Инициализируйте переменные для суммы чётных и нечётных чисел
even_sum = 0
odd_sum = 0

# Шаг 4: Пройдитесь по списку чисел и определите, чётное число или нечётное.
# Если число чётное, добавьте его к even_sum, если нечётное – к odd_sum.
# Для каждого числа выведите сообщение с указанием его четности.
for num in numbers:
    # Проверьте, является ли число четным
    # Подсказка: число четное, если остаток от деления на 2 равен 0 (num % 2 == 0)

    # Если число чётное:
    #   - Выведите сообщение: "Число X является чётным"
    #   - Добавьте число к even_sum
    # Иначе:
    #   - Выведите сообщение: "Число X является нечётным"
    #   - Добавьте число к odd_sum
    # Замените pass вашим кодом
    if num % 2 == 0:
        even_sum += num
        print(f'Number {num} is even')
    else:
        odd_sum += num
        print(f'{num} is odd')

# Шаг 5: Выведите итоговые суммы чётных и нечётных чисел
print("Сумма чётных чисел:", even_sum)
print("Сумма нечётных чисел:", odd_sum)
